app/controllers/users_controller.rb

  def archive_user

    # binding.pry
    user_id =  params[:user_id]
    user = User.where(id:user_id).first
---
SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1