app/controllers/users_controller.rb

  def index
    render jsonapi: User.all
---
SELECT `users`.* FROM `users` ORDER BY `users`.`id` ASC LIMIT 1